#!/usr/bin/env python
# coding:utf-8
# Copyright (C) dirlt

import sys
stdout = sys.stdout
reload(sys)
sys.setdefaultencoding('utf8')
sys.stdout = stdout

from datetime import datetime
from datetime import timedelta
import os
from jinja2 import Template
import mutagen.mp3
import time
from email import utils
import hashlib
import uuid
import urllib

my_files = (
    ('中国古代及世界近现代政治史.1.中国古代的政治制度（上）袁腾飞', 54109674, '01:52:43'),
    ('中国古代及世界近现代政治史.2.中国古代的政治制度（下）、西方近代民主政治（一）袁腾飞', 53311581, '01:51:03'),
    ('中国古代及世界近现代政治史.3.西方近代民主政治（二）.袁腾飞', 51749668, '01:47:48'),
    ('中国古代及世界近现代政治史.4.近代中国反侵略、求民主的潮流（一）袁腾飞', 52730201, '01:49:51'),
    ('中国古代及世界近现代政治史.5.近代中国反侵略、求民主的潮流（二）袁腾飞', 52227186, '01:48:48'),
    ('中国古代及世界近现代政治史.6.近代中国反侵略、求民主的潮流（三）袁腾飞', 50458383, '01:45:07'),
    ('中国古代及世界近现代政治史.7.近代中国反侵略、求民主的潮流（四）袁腾飞', 50424946, '01:45:03'),
    ('中国古代史.01.先秦（上）.袁腾飞', 56200934, '01:57:05'),
    ('中国古代史.02.先秦（下）、秦汉（上）.袁腾飞', 53122455, '01:50:40'),
    ('中国古代史.03.秦汉（下）、魏晋南北朝（上）.袁腾飞', 55500225, '01:55:37'),
    ('中国古代史.04.魏晋南北朝（下）.袁腾飞', 35494608, '01:13:56'),
    ('中国古代史.05.隋唐（一）.袁腾飞', 39526998, '01:22:20'),
    ('中国古代史.06.隋唐（二）.袁腾飞', 54099772, '01:52:42'),
    ('中国古代史.07.隋唐（三）.袁腾飞', 47112411, '01:38:08'),
    ('中国古代史.08.隋唐（四）.袁腾飞', 28430182, '00:59:13'),
    ('中国古代史.09.宋元（一）.袁腾飞', 55908571, '01:56:28'),
    ('中国古代史.10.宋元（二）.袁腾飞', 54124721, '01:52:45'),
    ('中国古代史.12.明清（一）.袁腾飞', 47171761, '01:38:16'),
    ('中国古代史.13.明清（二）.袁腾飞', 52053524, '01:48:26'),
    ('中国古代史.14.明清（三）.袁腾飞', 52040150, '01:48:24'),
    ('中国古代史.15.明清（四）.袁腾飞', 56006920, '01:56:40'),
    ('中国古代史.16.明清（五）.袁腾飞', 49068878, '01:42:13'),
    ('中国古代史.17.明清（六）.袁腾飞', 51862308, '01:48:02'),
    ('当代政治格局.01.现代中国外交1.袁腾飞', 27583477, '00:57:27'),
    ('当代政治格局.02.现代中国外交2.袁腾飞', 27135425, '00:56:31'),
    ('当代政治格局.03.世界格局多极化1.袁腾飞', 29615386, '01:01:41'),
    ('当代政治格局.04.世界格局多极化2.袁腾飞', 26446629, '00:55:05'),
    ('改革-民主-战争-人物.01.明治维新（上）.袁腾飞', 54547825, '01:53:38'),
    ('改革-民主-战争-人物.03.戊戌变法（上）.袁腾飞', 17092867, '00:35:36'),
    ('改革-民主-战争-人物.04.戊戌变法（下）.袁腾飞', 41449984, '01:26:21'),
    ('改革-民主-战争-人物.05.俄国1861年改革.袁腾飞', 13859871, '00:28:52'),
    ('改革-民主-战争-人物.06.中国古代的改革.袁腾飞', 51846216, '01:48:00'),
    ('改革-民主-战争-人物.07.《历史上重大改革回眸》专项训练.袁腾飞', 34927985, '01:12:45'),
    ('改革-民主-战争-人物.08.英、美民主政治的建立.袁腾飞', 55474022, '01:55:34'),
    ('改革-民主-战争-人物.09.法国大革命.袁腾飞', 55251459, '01:55:06'),
    ('改革-民主-战争-人物.10.近代中国的民主进程.袁腾飞', 37259570, '01:17:37'),
    ('改革-民主-战争-人物.11.中国古代的杰出帝王（一）.袁腾飞', 26484164, '00:55:10'),
    ('改革-民主-战争-人物.12.中国古代的杰出帝王（二）.袁腾飞', 27469294, '00:57:13'),
    ('改革-民主-战争-人物.13.中国古代的杰出帝王（三）.袁腾飞', 25608749, '00:53:21'),
    ('改革-民主-战争-人物.14.中国古代的杰出帝王（四）.袁腾飞', 28733621, '00:59:51'),
    ('改革-民主-战争-人物.15.西方资产阶级革命领袖.袁腾飞', 21396845, '00:44:34'),
    ('改革-民主-战争-人物.16.综合练习.袁腾飞', 20074004, '00:41:49'),
    ('改革-民主-战争-人物.17.第一次世界大战（上）.袁腾飞', 27730182, '00:57:46'),
    ('改革-民主-战争-人物.18.第一次世界大战（下）.袁腾飞', 27096346, '00:56:26'),
    ('改革-民主-战争-人物.19.第二次世界大战（一）.袁腾飞', 27056640, '00:56:22'),
    ('改革-民主-战争-人物.20.第二次世界大战（二）.袁腾飞', 27314103, '00:56:54'),
    ('改革-民主-战争-人物.21.第二次世界大战（三）.袁腾飞', 27139814, '00:56:32'),
    ('改革-民主-战争-人物.22.第二次世界大战（四）.袁腾飞', 28227762, '00:58:48'),
    ('改革-民主-战争-人物.23.第二次世界大战（五）.袁腾飞', 26787683, '00:55:48'),
    ('改革-民主-战争-人物.24.第二次世界大战（六）.袁腾飞', 25863784, '00:53:52'),
    ('近现代史.01.中国开始沦为半殖民地半封建社会（上）.袁腾飞', 52370964, '01:49:06'),
    ('近现代史.02.中国开始沦为半殖民地半封建社会（下）.中国近代化的开端和资本主义的产生、发展（上）.袁腾飞', 54518647, '01:53:34'),
    ('近现代史.03.中国近代化的开端和资本主义的产生、发展（下）.袁腾飞', 55926962, '01:56:30'),
    ('近现代史.04.资产阶级民主革命、维护民主共和的斗争.袁腾飞', 55759778, '01:56:09'),
    ('近现代史.05.北洋军阀的统治、新文化运动.袁腾飞', 48486244, '01:41:00'),
    ('近现代史.06.国民大革命、国共的十年对峙（上）.袁腾飞', 55710040, '01:56:03'),
    ('近现代史.07.国共的十年对峙（下）.袁腾飞', 48989256, '01:42:03'),
    ('近现代史.08.抗日战争.袁腾飞', 44743209, '01:33:12'),
    ('近现代史.09.人民解放战争、过渡时期.袁腾飞', 50657043, '01:45:32'),
    ('近现代史.12.现代化建设新局面的形成.袁腾飞', 44778029, '01:33:17'),
    ('近现代史.13.各族人民共同发展、中国的外交和国防.袁腾飞', 48462339, '01:40:57'),
    ('近现代史.14.欧洲资本主义的兴起（上）.袁腾飞', 54199038, '01:52:54'),
    ('近现代史.15.欧洲的资本主义兴起（下）、资产阶级革命时代的东西方（上）.袁腾飞', 54239998, '01:52:59'),
    ('近现代史.16.资产阶级革命时代的东西方（下）.袁腾飞', 50759523, '01:45:44'),
    ('近现代史.17.启蒙运动、工业化初期.袁腾飞', 53123500, '01:50:40'),
    ('近现代史.18.自由资本主义（上）.袁腾飞', 46556943, '01:36:59'),
    ('近现代史.19.自由资本主义（中）.袁腾飞', 53776272, '01:52:01'),
    ('近现代史.20.自由资本主义（下）、垄断资本主义（上）.袁腾飞', 52178076, '01:48:42'),
    ('近现代史.21.垄断资本主义（下）.袁腾飞', 51282598, '01:46:50'),
    ('近现代史.22.两次大战间的世界（上）.袁腾飞', 54299428, '01:53:07'),
    ('近现代史.23.两次大战间的世界（下）.袁腾飞', 53608124, '01:51:40'),
    ('近现代史.24.第二次世界大战、两极格局（上）.袁腾飞', 55070982, '01:54:43'),
    ('近现代史.25.两极格局（下）.袁腾飞', 55247986, '01:55:05'),
    ('高考历史针对D.模拟训练7.袁腾飞', 24815333, '00:51:41'),
    ('高考历史针对D.模拟训练8.袁腾飞', 22266200, '00:46:23'),
    ('高考考前讲座A.世界史串讲复习.袁腾飞', 21541142, '00:44:52'),
    ('高考考前讲座A.世界格局多极化.袁腾飞', 29077263, '01:00:34'),
    ('高考考前讲座A.综合练习1.袁腾飞', 26034520, '00:54:14'),
    ('高考考前讲座A.综合练习2.袁腾飞', 26639725, '00:55:29'),
    ('高考考前讲座A.综合练习3.袁腾飞', 25031418, '00:52:08'),
    ('高考考前讲座A.综合练习4.袁腾飞', 25631190, '00:53:23'),
    ('高考考前讲座A.综合练习5.袁腾飞', 26102230, '00:54:22'),
    ('高考考前讲座A.综合练习6.袁腾飞', 24355787, '00:50:44'),
    ('高考考前讲座B.袁腾飞', 54358489, '01:53:14'),
    ('高考考前讲座C.解题思路和复习建议.袁腾飞', 69300667, '02:24:22'),
    ('高考考前讲座D.模拟训练1.袁腾飞', 24218278, '00:50:27'),
    ('高考考前讲座D.模拟训练2.袁腾飞', 18870700, '00:39:18'),
    ('高考考前讲座D.模拟训练3.袁腾飞', 21418788, '00:44:37'),
    ('高考考前讲座D.模拟训练4.袁腾飞', 22772767, '00:47:26'),
    ('高考考前讲座D.模拟训练5.袁腾飞', 21411892, '00:44:36'),
    ('高考考前讲座D.模拟训练6.袁腾飞', 20055823, '00:41:46'),
    ('高考考前讲座E.高考热点问题举例.袁腾飞', 67400414, '02:20:24'),
)

RSS_TEMPLATE = """<?xml version="1.0" encoding="UTF-8"?>
<rss xmlns:itunes="http://www.itunes.com/dtds/podcast-1.0.dtd"
     xmlns:atom="http://www.w3.org/2005/Atom"
     version="2.0">
    <channel>
        <atom:link href="http://file.dirtysalt.info/rss/{{ name }}.xml" type="application/rss+xml" rel="self"/>
        <copyright>dirtysalt</copyright>
        <link>http://dirtysalt.github.io</link>
        <language>{{ language or "zh-cn"}}</language>

        <title>{{ title }}</title>
        <description>{{ description }}</description>
        <pubDate>{{ releaseDate }}</pubDate>

        <itunes:summary>{{ summary }}</itunes:summary>
        <itunes:subtitle>{{ subtitle }}</itunes:subtitle>
        <itunes:author>{{ author }}</itunes:author>
        <itunes:image href="{{ image_url }}"/>
        <itunes:owner>
            <itunes:name>{{ author }}</itunes:name>
            <itunes:email>{{ email }}</itunes:email>
        </itunes:owner>
        <itunes:keywords>{{ keywords }}</itunes:keywords>
        <itunes:category text="Education"/>
        <itunes:explicit>no</itunes:explicit>

        {% for t in tracks %}
        <item>
            <title>{{ t.title }}</title>
            <description>{{ t.description }}</description>
            <itunes:summary>{{ t.summary }}</itunes:summary>
            <itunes:image href="{{ t.image_url }}"/>
            <!-- <itunes:order>{{ t.itunes_order }}</itunes:order> -->
            <enclosure url="{{ t.audio_url }}" type="audio/mp3" length="{{ t.audio_size or 0}}"/>
            <itunes:duration>{{ t.audio_duration or 0 }}</itunes:duration>
            <guid isPermaLink="false">{{ t.guid }}</guid>
            <pubDate>{{ t.releaseDate }}</pubDate>
            <itunes:explicit>no</itunes:explicit>
        </item>
        {% endfor %}
    </channel>
</rss>
"""

template = Template(RSS_TEMPLATE)

def get_audio_duration(f):
    x = mutagen.mp3.MP3(f)
    return x.info.length

def audio_duration_text(v):
    return '%02d:%02d:%02d' % (v / 3600, (v % 3600) / 60, v % 60)

def get_file_size(f):
    return os.path.getsize(f)

now = datetime.now()

def to_rfc822_datetime(nowdt):
    nowtuple = nowdt.timetuple()
    nowtimestamp = time.mktime(nowtuple)
    return utils.formatdate(nowtimestamp)

def get_sha1_key(s):
    return hashlib.sha1(s).hexdigest()

def gen_uuid(s):
    x = uuid.uuid3(uuid.NAMESPACE_DNS, s)
    return str(x)

tracks = []
image_url = 'http://file.dirtysalt.info/rss/ytf-history-class.jpg'
ctx = {
    'name': 'ytf-history-class',
    'title': '袁腾飞历史课程',
    'description': '\n'.join(map(lambda x: '%d. %s' % (x[0] + 1, x[1][0]), enumerate(my_files))),
    'releaseDate': to_rfc822_datetime(now),
    'tracks': tracks,
    'author': 'dirtysalt',
    'email': 'dirtysalt1987@gmail.com',
    'image_url': image_url
}

order = 0
for (name, size, duration) in my_files:
    t = {
        'title': name,
        'audio_url': 'http://file.dirtysalt.info/' + urllib.quote('%s/mp3/%s.mp3' % (ctx['name'], name)),
        'audio_size': size,
        'audio_duration': duration,
        'guid': gen_uuid(name),
        'releaseDate': to_rfc822_datetime(now - timedelta(hours = order)),
        'itunes_order': order + 1,
        'image_url': image_url
    }
    order += 1
    tracks.append(t)

rss = template.render(**ctx)
with open('%s.xml' % ctx['name'], 'w') as fh:
    fh.write(rss)
